
/*
 * ЕСЛИ СЕГОДНЯ БУДЕТ
 * 
 * начать
 * получить рандом эвент
 * использовать айтемы
 * побеждать врагов
 * делать какие то выборы
 * закончить
 *
 * ТО все ОТЛИЧНО
 *
 * если НЕ БУДЕТ
 * то будет 3 дня джема :|
 * что не так отлично и похуй
 */

/*
 * 1. 2 деливери                                                    +
 * 2. 2-3 рандом эвента                                           +/-
 * 3. 1-2 боя с врагами                                           +/-
 * 4. добавить предметы которые можно использовать для выживания.   +
 * 5. причесать визуал                                              -
 * 6. начало и конец                                              +/-
 */

/*
 * 1. не обязательно делать прям вариантивный гемплей как оно кажется должно быть, игроки не хотят переигрывать эти игры больше 1 раза
 * 2. надо сделать максимально приятную и понятную презентацию того что есть, но при этом чтоб не ощущалось что все на рельсах
 * 3. цель - показать концепт, вайб, атмосферу идею вот этой смеси типа "доставщик в сайлент хилле"
 * 4. не будем делать контент к ущерб его презентации, потому что все равно играть не будет никто если он презентован хуево
 */

/*
 * Я проснулся здесь в крови...
 * Ничего не помню...
 * В кармане был телефон. Он звонил.
 */
 
/*
 * А что нужно чтобы выйграть?
 * Чтобы игрок ушел удовлетворенным
 * Ему нужно пообещать загадку. Давать подсказки. И дать твист.
 * Геймплей должен быть достаточно отполирован чтобы игрок не подумал что игра пустышка, что механики это все фикция.
 * Meaningful play
 * Атмосфера, нужны особенно интересные локации
 *     Типа, описания вещей.
 *     Нужен триггер ворнинг
 */

/*
* би2 пекло
*/